# Groupby

The groupby method allows you to group rows of data together based on a column e.g ID and call aggregate functions on the row values e.g sum, average e.t.c

In [2]:
import pandas as pd
# Create dataframe from a key:value pair store
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [8]:
df = pd.DataFrame(data, index=['R1','R2','R3','R4','R5','R6'])
df.index.name = 'Index'
df

      Company   Person  Sales
Index
R1       GOOG      Sam    200
R2       GOOG  Charlie    120
R3       MSFT      Amy    340
R4       MSFT  Vanessa    124
R5         FB     Carl    243
R6         FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [10]:
grp_by_co = df.groupby("Company")
grp_by_co

And then call aggregate methods off the object:

In [12]:
grp_by_co.mean()  # Pandas will ignore non-numeric columns when attempting to use numeric aggregation functions. Returns a df of companies with thieir mean sales.

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [13]:
df.groupby('Company').mean()    # The short method

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [17]:
df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [18]:
df.groupby('Company').std().loc['FB']   # The result is always a DataFrame so the df methods can also be used on the result. Retrieves a row in the df where the row value = 'FB'

Sales    75.660426
Name: FB, dtype: float64

In [30]:
df.groupby('Company').min() # min() will work on both alphanumeric cols, returning the min sales values for each co and also the person whose name is lowest placed alphabetically in ascending order.

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [31]:
# Letters have numeric unicode representation that Python uses to compare letters
'a' > 'b'

False

In [27]:
'a' < 'b'

True

In [29]:
'a' == 'A'

False

In [33]:
ord('a')

97

In [35]:
ord('b')

98

In [36]:
ord('A')

65

In [41]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [39]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [42]:
grp_by_co.count() # Returns the company data values frequency in each col.

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [43]:
grp_by_co.describe() # Returns useful statisitcs about a DataFrame

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [47]:
desc_data = grp_by_co.describe().transpose()
desc_data

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [49]:
desc_data['GOOG']  # Fetch on a column from above df

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [55]:
desc_data.transpose()   # Fetch on a row basis
desc_data.loc['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Great Job!